Model: "model_6"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            (None, 28, 28, 1)    0                                            
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 28, 28, 32)   832         input_4[0][0]                    
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 28, 28, 64)   51264       conv2d_11[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 14, 14, 64)   0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 14, 14, 64)   102464      max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 14, 14, 64)   4160        conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 14, 14, 64)   4160        conv2d_14[0][0]                  
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 14, 14, 64)   0           max_pooling2d_4[0][0]            
                                                                 conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 14, 14, 64)   4160        conv2d_14[0][0]                  
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 12544)        0           multiply_2[0][0]                 
__________________________________________________________________________________________________
global_average_pooling2d_4 (Glo (None, 64)           0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 512)          6423040     flatten_2[0][0]                  
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 10)           650         global_average_pooling2d_4[0][0] 
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 10)           5130        dense_7[0][0]                    
==================================================================================================
Total params: 6,595,860
Trainable params: 6,595,860
Non-trainable params: 0
__________________________________________________________________________________________________
