Model: "model_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_23 (InputLayer)        (None, 28, 28, 1)         0         
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 28, 28, 32)        832       
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 28, 28, 64)        51264     
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 14, 14, 64)        0         
_________________________________________________________________
global_average_pooling2d_6 ( (None, 64)                0         
_________________________________________________________________
dense_25 (Dense)             (None, 10)                650       
=================================================================
Total params: 52,746
Trainable params: 52,746
Non-trainable params: 0
_________________________________________________________________
